# SQL #3 - SubQuery
Before start this notebook, please make sure to complete this following list:
- Install [XAMPP](https://www.apachefriends.org/index.html)
- Start MySQL Database, and Apache Webserver
- Install Package `SQLAlchemy` on notebook, this package is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL
- Import database `mysqlsampledatabase.sql` to MySQL Database

## Connect to database
Connect to localhost, using `classicmodels` database with default user.

In [1]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine

host = 'localhost'
port = "3306"
user = 'root'
password = ''
database = 'classicmodels'

#create connection to database
engine = create_engine('mysql+pymysql://'+user+':'+password+'@'+host+':'+port+'/'+database)
# engine = create_engine('mysql+pymysql://root: @localhost:3306/classicmodels)

def run(sql):
    df = pd.read_sql_query(sql,engine)
    return df

## Input CSV to MySQL
- Open `student.csv` file, see the structure of that file which contains `ID, Name` in their header.
- Read Data from `studen.csv` file
- input csv to SQL database

In [2]:
#CSV to DataFrame to MySQL
df_fromcsv = pd.read_csv('student.csv')
df_fromcsv.to_sql(name = 'student', con = engine, if_exists = 'replace', index = False)
# if_exists = 'fail' | 'replace' | 'append'

In [3]:
df_result = run("SELECT * FROM student")
print(df_result)

   ID    Name
0  11     Ani
1  22    Budi
2  33   Citra
3  44   Damar
4  55    Esti

## Add data using Query INSERT
Insert will be autocommit

In [4]:
engine.execute("INSERT INTO student VALUES(66,'Fajar')")

In [5]:
run("SELECT * FROM student")

   ID    Name
0  11     Ani
1  22    Budi
2  33   Citra
3  44   Damar
4  55    Esti
5  66   Fajar

## Fetch Data

In [6]:
engine.execute("select * from student").fetchall()

[(11, ' Ani'),
 (22, ' Budi'),
 (33, ' Citra'),
 (44, ' Damar'),
 (55, ' Esti'),
 (66, 'Fajar')]

## Read Data in the Tabel Form

In [7]:
df_results = run("select * from student")
print(df_results)

   ID    Name
0  11     Ani
1  22    Budi
2  33   Citra
3  44   Damar
4  55    Esti
5  66   Fajar

# Subquery

A **subquery** is a query that is nested inside a SELECT , INSERT , UPDATE , or DELETE statement, or inside another subquery. A subquery can be used anywhere an expression is allowed.

<img src="https://www.mysqltutorial.org/wp-content/uploads/2013/02/mysql-subquery.gif">

In [8]:
run("""
SELECT 
    lastName, 
    firstName
FROM
    employees
WHERE
    officeCode IN (SELECT 
            officeCode
        FROM
            offices
        WHERE
            country = 'USA')
""")

    lastName firstName
0     Murphy     Diane
1  Patterson      Mary
2   Firrelli      Jeff
3        Bow   Anthony
4   Jennings    Leslie
5   Thompson    Leslie
6   Firrelli     Julie
7  Patterson     Steve
8      Tseng  Foon Yue
9     Vanauf    George

## Comparison
<img src="http://www.mysqltutorial.org/wp-content/uploads/2013/05/payments_table.png">

In [9]:
run("""
SELECT 
    customerNumber, checkNumber, amount
FROM
    payments
WHERE
    amount = (SELECT 
            MAX(amount)
        FROM
            payments);
""")

   customerNumber checkNumber     amount
0             141    JE105477  120166.58

In [10]:
run("""
SELECT 
    customerNumber, checkNumber, amount
FROM
    payments
WHERE
    amount > (SELECT 
            AVG(amount)
        FROM
            payments);

""")

     customerNumber checkNumber     amount
0               112     HQ55022   32641.98
1               112    ND748579   33347.88
2               114     GG31455   45864.03
3               114    MA765515   82261.22
4               114     NR27552   44894.74
5               119    LN373447   47924.19
6               119     NG94694   49523.67
7               121    DB889831   50218.95
8               121    MA302151   34638.14
9               124    AE215433  101244.59
10              124    BG255406   85410.87
11              124     ET64396   83598.04
12              124    HI366474   47142.70
13              124     HR86578   55639.66
14              124    KI131716  111654.40
15              124    LF217299   43369.30
16              124    NT141748   45084.38
17              128    FH668230   33820.62
18              131    MA724562   50025.35
19              131    NB445135   35321.97
20              141    AU364101   36251.03
21              141    DB583216   36140.38
22              141    DL460618   46895.48
23              141     HJ32686   59830.55
24              141     ID10962  116208.40
25              141    IN446258   65071.26
26              141    JE105477  120166.58
27              141    JN355280   49539.37
28              141    JN722010   40206.20
29              141     KT52578   63843.55
..              ...         ...        ...
104             334    CS435306   45785.34
105             339     DA98827   34606.28
106             350    CI471510   50824.66
107             353    CO351193   49705.52
108             353    HJ618252   46656.94
109             357    NB291497   36442.34
110             363    HL575273   50799.69
111             363    PN238558   55425.77
112             379    FR499138   32680.31
113             382    CC871084   35826.33
114             382     PH29054   42813.83
115             385    EK785462   51001.22
116             386    DO106109   38524.29
117             386    HG438769   51619.02
118             398    AJ478695   33967.73
119             398     KB54275   48927.64
120             406    HJ217687   49165.16
121             412    GH197075   35034.57
122             448    KR822727   48809.90
123             450    EF485824   59551.38
124             455    HA777606   38139.18
125             458    DD995006   33145.56
126             458    OO606861   57131.92
127             462    PE176846   48355.87
128             471    CO645196   35505.63
129             475    PB951268   36070.47
130             484    JH546765   47513.19
131             486     HS86661   45994.07
132             495    BH167026   59265.14
133             496     MN89921   52166.00

[134 rows x 3 columns]

## Using the IN and NOT IN Operators

In [11]:
run("""
SELECT 
    customerName
FROM
    customers
WHERE
    customerNumber NOT IN (SELECT DISTINCT
            customerNumber
        FROM
            orders);

""")

                      customerName
0               Havel & Zbyszek Co
1           American Souvenirs Inc
2                Porto Imports Co.
3       Asian Shopping Network, Co
4                  Natürlich Autos
5                    ANG Resellers
6         Messner Shopping Network
7                Franken Gifts, Co
8                BG&E Collectables
9                 Schuyler Imports
10                Der Hund Imports
11       Cramer Spezialitäten, Ltd
12           Asian Treasures, Inc.
13            SAR Distributors, Co
14                 Kommission Auto
15          Lisboa Souveniers, Inc
16           Precious Collectables
17  Stuttgart Collectable Exchange
18        Feuer Online Stores, Inc
19                Warburg Exchange
20             Anton Designs, Ltd.
21             Mit Vergnügen & Co.
22       Kremlin Collectables, Co.
23              Raanan Stores, Inc

## Subquery in FROM
The goal is to create a temporary table that does not have tables in the database

In [12]:
run("""
SELECT 
    MAX(items), MIN(items), FLOOR(AVG(items))
FROM
    (SELECT 
        orderNumber, COUNT(orderNumber) AS items
    FROM
        orderdetails
    GROUP BY orderNumber) AS lineitems;

""")

   MAX(items)  MIN(items)  FLOOR(AVG(items))
0          18           1                9.0